# TypeTag Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReinforcementAbbreviationTag..::..TypeTag Property
ReinforcementAbbreviationTag Class See Also
---
The abbreviation tag type.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ReinforcementAbbreviationTagType TypeTag { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TypeTag As ReinforcementAbbreviationTagType
	Get
```

Visual C++
---
```text
public:
property ReinforcementAbbreviationTagType TypeTag {
	ReinforcementAbbreviationTagType get ();
}
```

# See Also
ReinforcementAbbreviationTag Class
Autodesk.Revit.DB.Structure Namespace